{
  "v": "2.0",
  "name": "joplin-server",
  "image": "joplin/server:latest",
  "port": 22300,
  "env_vars": {
    "APP_BASE_URL":"https://joplin-server.{{ portal.domain }}/",
    "DB_CLIENT": "pg",
    "POSTGRES_PASSWORD": "{{ apps[\"joplin-server\"].postgres.password }}",
    "POSTGRES_DATABASE": "joplin-server",
    "POSTGRES_USER": "{{ apps[\"joplin-server\"].postgres.user }}",
    "POSTGRES_PORT": "{{ apps[\"joplin-server\"].postgres.port }}",
    "POSTGRES_HOST": "{{ apps[\"joplin-server\"].postgres.host }}"
  },
  "services": [
    "postgres"
  ],
  "paths": {
    "": {
      "access": "public",
      "headers": null
    }
  },
  "store_info": {
    "description_short": "Joplin is an open source note-taking app. Capture your thoughts and securely access them from any device.",
    "description_long": [
      "Joplin is a free, open source note taking and to-do application, which can handle a large number of notes organised into notebooks. The notes are searchable, can be copied, tagged and modified either from the applications directly or from your own text editor. The notes are in Markdown format.",
      "Notes exported from Evernote can be imported into Joplin, including the formatted content (which is converted to Markdown), resources (images, attachments, etc.) and complete metadata (geolocation, updated time, created time, etc.). Plain Markdown files can also be imported.",
      "The notes can be securely synchronised using end-to-end encryption with various cloud services including the Joplin-Server for Portal.",
      "Full text search is available on all platforms to quickly find the information you need. The app can be customised using plugins and themes, and you can also easily create your own.",
      "The application is available for Windows, Linux, macOS, Android and iOS. A Web Clipper, to save web pages and screenshots from your browser, is also available for Firefox and Chrome."
    ],
    "hint": [
      "The app is publicly accessible, so you MUST change the default password after installation!",
      "The default user is 'admin@localhost' and the default password is 'admin'",
      "While the admin user can be used for synchronisation, it is recommended to create a separate non-admin user for it."
    ]
  }
}